Tekla.Structures.CatalogInternal.RebarItemComparer
Rebar Item Comparer class.

Tekla.Structures.CatalogInternal.RebarItemComparer.Equals(Tekla.Structures.Catalogs.RebarItem,Tekla.Structures.Catalogs.RebarItem)
Return true if both Rebar items are equal.
rebarItem1: RebarItem 1.
rebarItem2: RebarItem 2.
Returns: True on success

Tekla.Structures.CatalogInternal.RebarItemComparer.GetHashCode(Tekla.Structures.Catalogs.RebarItem)
Returns the hash code.
obj: obj.
Returns: hash code